{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"conv_lstm2d_input": {"name": "conv_lstm2d_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800000"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/time", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_counter", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d_1/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_lstm2d_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/transpose", "op": "Transpose", "input": ["conv_lstm2d_input", "StatefulPartitionedCall/sequential/conv_lstm2d/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/zeros_like", "op": "ZerosLike", "input": ["conv_lstm2d_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/transpose", "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/zeros_like", "StatefulPartitionedCall/sequential/conv_lstm2d/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/Shape", "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice/stack", "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice/stack_1", "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/Sum", "StatefulPartitionedCall/sequential/conv_lstm2d/zeros"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/conv_lstm2d/convolution"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/convolution", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/convolution", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/time", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_counter", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/maximum_iterations", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopControlInputs/_24"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9jb252X2xzdG0yZC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_16", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_55"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_18", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_57"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_17", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_20", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_19", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_15", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_54"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_13", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_52"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_14", "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_53"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/cond/_11/sequential/conv_lstm2d/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_27", "StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_31", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_32", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_25", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_26", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_28", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_29", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_30"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/cond/_11/sequential/conv_lstm2d/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_32", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_29", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_30", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_31", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/time_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_27", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_counter_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_25", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/maximum_iterations_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_26", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/merge/_28", "StatefulPartitionedCall/sequential/conv_lstm2d/while/LoopCond/_33"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_38"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_39"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/time_switch/_36"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_counter_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_body_control/_42", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_counter_switch/_34:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/maximum_iterations_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1_switch/_37"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor_switch/_41", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2_1_switch/_37", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_38", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_39", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice_switch/_40", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/time_switch/_36", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_body_control/_42", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/maximum_iterations_switch/_35", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/exit/_46", "StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/Const_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/Const_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/clip_by_value_2/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/clip_by_value_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/Const_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/clip_by_value_1/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_127", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/convolution_switch/_38:1", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_125", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/time_switch/_36:1", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/add_8/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/add_9/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/output_control_node/_145", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_21", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_22", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/enter/_23"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/conv_lstm2d/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/convolution_7", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_127", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-3"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/convolution_5", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_127", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/convolution_4", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_127", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-0"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/convolution_6", "op": "Conv2D", "input": ["Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_127", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_1-folded-2"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor_switch/_41:1", "Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_125", "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/add_8", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input/_125", "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/add_8/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/add_9", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/loop_counter_switch/_34:1", "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/add_9/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_59", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/TensorArrayUnstack/TensorListFromTensor_switch/_41:1", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/output_control_node/_145", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_58", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/strided_slice_switch/_40:1", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/output_control_node/_145", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/StatefulPartitionedCall/sequential/conv_lstm2d/while/maximum_iterations_switch/_35:1", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/output_control_node/_145", "^StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/NoOp", "^Func/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/input_control_node/_122"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/max_pooling3d/MaxPool3D", "op": "MaxPool3D", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/transpose_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "ksize": {"list": {"i": ["1", "1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/BiasAdd_3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-3", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-3"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/BiasAdd_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-1", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-1"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split-folded-0", "ConstantFolding/StatefulPartitionedCall/sequential/conv_lstm2d/while/body/_12/sequential/conv_lstm2d/while/split_2-folded-0"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": 