{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"module_wrapper_input": {"name": "module_wrapper_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800000"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/while/maximum_iterations", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/zeros", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/maximum_iterations", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper_1/sep_conv_lst_m2d_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "module_wrapper_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/zeros_like", "op": "ZerosLike", "input": ["module_wrapper_input"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/transpose", "op": "Transpose", "input": ["module_wrapper_input", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/zeros_like", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/transpose", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/Sum", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/zeros"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/Shape", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice/stack", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice/stack_1", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d/depthwise", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/zeros_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "_has_manual_control_dependencies": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/time", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_counter", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/maximum_iterations", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}, "is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_28", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "_has_manual_control_dependencies": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_29", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_5", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopControlInputs/_30"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9tb2R1bGVfd3JhcHBlci9zZXBfY29udl9sc3RfbTJkL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_20", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_61"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_22", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_63"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_21", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_62"], "attr": {"_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_24", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_65"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_23", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_64"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_19", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_60"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_17", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_18", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/next_iteration/_59"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/cond/_15/sequential/module_wrapper/sep_conv_lst_m2d/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_33", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_37", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_38", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_26", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_28", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_29", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_31", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_32", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_34", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_35", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/cond/_15/sequential/module_wrapper/sep_conv_lst_m2d/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_38", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_35", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d_switch/_45", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_36", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice_switch/_46", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_37", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/time_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_33", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_counter_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_31", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/maximum_iterations_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_32", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/merge/_34", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/LoopCond/_39"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_56", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_47"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_53", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d_switch/_44"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_54", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d_switch/_45"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_55", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice_switch/_46"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/time_switch/_42"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_counter_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_body_control/_48", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_counter_switch/_40:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/maximum_iterations_switch/_41"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1_switch/_43"], "attr": {"T": {"type": "DT_VARIANT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayUnstack/TensorListFromTensor_switch/_47", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2_1_switch/_43", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d_switch/_44", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/separable_conv2d_switch/_45", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/strided_slice_switch/_46", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/time_switch/_42", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/loop_body_control/_48", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/maximum_iterations_switch/_41", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_26", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_28", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/exit/_52", "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_2-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_1-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_3-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_28"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/Const_4", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/Const_5", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/clip_by_value_2/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/clip_by_value_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_2-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_1-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_3-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/Const_3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/clip_by_value_1/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_2-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_1-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_3-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_28"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_25"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/sequential/module_wrapper/sep_conv_lst_m2d/while/split_2-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/body/_16/input_control_node/_132", "^StatefulPartitionedCall/sequential/module_wrapper/sep_conv_lst_m2d/while/enter/_27"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": 